---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IfcExportElement
source: html/dd9a48fd-b9d0-e6c5-4aae-57527cd70680.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IfcExportElement Property

"Export to IFC"

## Syntax (C#)
```csharp
public static ForgeTypeId IfcExportElement { get; }
```